In [1]:
import pandas as pd
df=pd.read_csv("student.csv")
df.groupby(["gender"]).mean()

         age    salary
gender
f       23.0  100000.0
m       23.0   67500.0

In [3]:
df.groupby(["age"]).mean()

       salary
age
21    60000.0
22    50000.0
23   100000.0
24    70000.0
25    90000.0

In [2]:
a=df.groupby(["gender","dept"])
print(a.groups)

{('f', 'civil'): [2], ('m', 'cse'): [1], ('m', 'ece'): [0], ('m', 'mech'): [3, 4]}

In [4]:
df.groupby(["salary"]).max()

        age   name gender   dept
salary
50000    22   siva      m    cse
60000    21  venky      m    ece
70000    24    sai      m   mech
90000    25  srinu      m   mech
100000   23  satya      f  civil

In [6]:
df.groupby(["age"]).min()

      name gender   dept  salary
age
21   venky      m    ece   60000
22    siva      m    cse   50000
23   satya      f  civil  100000
24     sai      m   mech   70000
25   srinu      m   mech   90000

In [5]:
df["dept"].value_counts()

mech     2
ece      1
cse      1
civil    1
Name: dept, dtype: int64